API_ID = 111111111
API_HASH = "ares"
BOT_TOKEN = "fsdfsdfdsfsfsdf"
DATABASE_URL = "sqlite+aiosqlite:///database.db"
DOMAIN = 'mydomain.com'
ADMIN_IDS = [5982685460]  # Example admin user IDs
CHANEL_ID = 'AzadBotChanell'

motivational_texts = [
    "هر روز یه فرصت جدیده، ازش استفاده کن.",
    "کوچیک شروع کن، ولی متوقف نشو.",
    "اگه خسته‌ای، استراحت کن؛ ولی تسلیم نشو.",
    "موفقیت نتیجه ادامه دادنه، نه شانسه.",
    "هیچ‌وقت برای شروع دوباره دیر نیست.",
    "همونی که امروز انجام میدی، فرداتو می‌سازه.",
    "به خودت اعتماد کن، بیشتر از چیزی که فکر می‌کنی بلدی.",
    "سختی‌ها نشونه راه درستن، نه اشتباه.",
    "قدم‌های کوچیک هم تو رو جلو می‌برن.",
    "مقایسه نکن، مسیر تو با بقیه فرق داره.",
    "هر پیشرفتی، هرچقدر کوچیک، ارزشمنده.",
    "ترس یعنی داری رشد می‌کنی.",
    "همین امروز می‌تونه نقطه‌ی تغییر باشه.",
    "اگه زمین خوردی، یعنی در حال حرکت بودی.",
    "روی چیزایی تمرکز کن که کنترلت دست خودته.",
    "باور کن می‌تونی، نصف راهو رفتی.",
    "نتیجه‌ها زمان می‌برن، صبور باش.",
    "از اشتباهاتت درس بگیر، نه عذاب.",
    "تو قوی‌تری از بهونه‌هات.",
    "موفقیت یه شبه نمیاد، ولی میاد.",
    "هر روز یه ذره بهتر از دیروز باش.",
    "هیچ تلاشی گم نمی‌شه.",
    "به جای کامل بودن، واقعی باش.",
    "ادامه بده، حتی وقتی انگیزه نداری.",
    "آینده متعلق به کساییه که ناامید نمی‌شن."
]
